---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
source: html/4f9ba499-2e31-245f-86e1-172869f2ceff.htm
---
# CircuitNamingSchemeSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.